# ### Списки:
#
# 1. **Робота із списками:**
#    Завдання: Створіть список чисел. Додайте до списку числа 10 і 20,
#    видаліть число 10 і виведіть отриманий список.

list_1 = [1, 4, 7, 11, 35]
list_1.append(10)
list_1.append(20)
list_1.remove(10)
print(list_1)

# 2. **Знаходження суми:**
#    Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.

print(sum(list_1)) #78

# 3. **Подвійні значення:**
#    Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.

first_list = [2, 3, 4]
double_list = []

for item in first_list:
    double_item = item * 2
    double_list.append(double_item)
    print( double_list) # [4, 6, 8]

# ### Кортежі:
# 1. **Робота із кортежами:**
#    Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин").
#    Виведіть кожен елемент кортежу окремо.

fruit_tuple = ("яблуко", "банан", "апельсин")
print(fruit_tuple[0], fruit_tuple[1], fruit_tuple[2]) # яблуко банан апельсин

# 2. **Об'єднання кортежів:**
#    Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.

tuple_1 = (1, 2, 3)
tuple_2 = (4, 5, 6)
tuple_3 = tuple_1 + tuple_2
print(tuple_3) #(1, 2, 3, 4, 5, 6)

# ### Словники:
#
# 1. **Робота із словниками:**
#    Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена
#    (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.

sportsman = {
    'name': 'Gleb',
    'age': 23,
    'sport': "football",
    'team': 'team name'
}

print(sportsman) #{'name': 'Gleb', 'age': 23, 'sport': 'football', 'team': 'team name'}

# 2. **Оновлення словника:**
#    Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання).
#    Додайте до словника нову улюблену книгу та виведіть оновлений словник.

books  = {
    1: {
        'title': 'Atlas Shrugged',
        'published' : 1957,
    },
    2: {
        'title': 'Shatter Me Series',
        'published' : 2021,
    }
}

books_update = {
    3: {
        'title': '1984',
        'published': 1949,
    }
}

books.update(books_update)
print(books) # {1: {'title': 'Atlas Shrugged', 'published': 1957}, 2: {'title': 'Shatter Me Series', 'published': 2021}, 3: {'title': '1984', 'published': 1949}}

# 3. **Пошук значення:**
#    Завдання: Створіть словник, що містить інформацію про країни та їх столиці.
#    Запитайте користувача про назву країни і виведіть столицю цієї країни
#    (якщо така країна є у словнику).

countries  = {
    'Ukraine' : 'Kyiv',
    'Poland': 'Warsaw'
}

capital = countries.get('Ukraine')
capital_2 = countries.get('France', 'Paris')
print(capital, capital_2) #Kyiv Paris