# Списки
# Створення списку:
# Список в Python - це змінна, яка може містити інші об'єкти. Список створюється за допомогою квадратних
# дужок [] або функції list(), і об'єкти в списку розділяються комами.
# my_list = [1, 2, 3, 4, 5] # Створення списку чисел
# fruits = ["apple", "banana", "cherry"] # Створення списку рядків
# mixed_list = [1, "apple", True, 3.14] # Створення списку з різними типами даних
# empty_list = [] # Порожній список

a = [1, 2, 3, 4, 5]
b = ['apple', 'banana', 'cherry']

# Індексація списку:
# Елементи списку індексуються, починаючи з 0 для першого елемента, 1 для другого і так далі. Щоб отримати
# доступ до елемента за його індексом, використовуйте квадратні дужки і індекс:
# rst_element = my_list[0] # Отримання першого елемента
# second_element = my_list[1] # Отримання другого елемента

print(a[0], a[1], a[-1], a[-2]) # a[0] - 1й елемент, a[1] - 2й елемент, a[-1] - останній елемент, a[-2] - передостанній елемент

# Зрізи списків (slicing):
# Зрізи дозволяють отримувати підсписки списку. Синтаксис для зрізів виглядає так: my_list[start : stop : step],
# де start - індекс початку зрізу, stop - індекс кінця зрізу (не включаючи його), step - крок.
# sublist = my_list[1:4] # Отримання підсписку з другого до четвертого елемента
# every_other = my_list[::2] # Отримання кожного другого елемента

print(a[1:4]) # виводить починаючи з першого по четвертий [2, 3, 4]
print(a[::2], a[::]) #[::2] - віддає з першого елемента з кроком 2 - [1, 3, 5], a[::] - віддає весь список - [1, 2, 3, 4, 5]
print(b[::-1]) # розвертає список - ['cherry', 'banana', 'apple']


# Методи списку

# .append(item): Додає item в кінець списку.
a.append(6)
b.append('tomato')
print(a, b)

# .insert(index, item): Вставляє item на певний index.
a.insert(3, 7.4) #на 3тю позицію вставити 7.4
print(a) #[1, 2, 3, 7.4, 4, 5, 6]

# .remove(item): Видаляє перше входження item зі списку.
a.remove(7.4)
print(a)

# .pop(): Видаляє і повертає останній елемент списку (або з певного індексу, якщо передати індекс).
a.pop() # Видаляє останній елемент списку
print(a) # [1, 2, 3, 4, 5]

removed_element = a.pop()
print(removed_element) # 5 - видалений елемент можна записати у змінну

a.pop(0)
print(a) # [2, 3, 4] - можна вказати порядковий номер елемента який треба видалити

# .index(item): Повертає індекс першого входження item у списку.
print(b.index('banana')) # 1 - повертає позицію на якій стоїть елемент

# .count(item): Повертає кількість входжень item у списку.
a.extend([5, 5, 5])
b.extend(['cherry', 'berry', 'apricot']) # extend додає елементи в кінець ['apple', 'banana', 'cherry', 'tomato', 'cherry', 'berry', 'apricot']

print(a.count(5), b.count('cherry')) # 3 2 - скільки 5к в а і скільки вишень в б

# .sort(): Сортує список за зростанням.
a.sort()
b.sort()
print(a, b) # [2, 3, 4, 5, 5, 5] ['apple', 'apricot', 'banana', 'berry', 'cherry', 'cherry', 'tomato'] - сортує за зростанням/алфавітом

a.sort(reverse=True)
print(a) # [5, 5, 5, 4, 3, 2] - сортує в зворотеьому порядку

# .reverse(): Розвертає список в зворотньому порядку.
b.reverse()
print(b) # ['tomato', 'cherry', 'cherry', 'berry', 'banana', 'apricot', 'apple'] - розвертає список